app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <p>
    <%= link_to pluralize(@movie.reviews.count, 'review'), movie_reviews_path(@movie) %>